'''
lab2.1 - 9.jpg (Вариант 23)
'''


x=float(input("Введите координаты x : "))
y=float(input("Введите координаты y : "))

x1=-2
y1=0
x2=0
y2=2
x3=1
y3=0
x4=0
y4=-2

a=(x1-x)*(y2-y1)-(x2-x1)*(y1-y)
b=(x2-x)*(y3-y2)-(x3-x2)*(y2-y)
c=(x3-x)*(y4-y3)-(x4-x3)*(y3-y)
d=(x4-x)*(y1-y4)-(x1-x4)*(y4-y)
kv1=((a>=0) and (b>=0) and (c>=0) and (d>=0))or((a<=0) and (b<=0) and (c<=0) and (b<=0))

x1=0
y1=0
x2=1
y2=2
x3=2
y3=0
x4=1
y4=-2

a=(x1-x)*(y2-y1)-(x2-x1)*(y1-y)
b=(x2-x)*(y3-y2)-(x3-x2)*(y2-y)
c=(x3-x)*(y4-y3)-(x4-x3)*(y3-y)
d=(x4-x)*(y1-y4)-(x1-x4)*(y4-y)
    
kv2=((a>=0) and (b>=0) and (c>=0) and (d>=0))or((a<=0) and (b<=0) and (c<=0) and (b<=0))

if (kv1 and kv2):
    print("точка находится в заштрихованной области")
else:
    print("точка не находится заштрихованной области")

